<?php
/*------------------------------------------------------------------
 | Software: APHP - A PHP TOP Framework
 | Site: https://aphp.top
 |------------------------------------------------------------------
 | CopyRight(C)2020-2024 大松栩<24203741@qq.com>,All Rights Reserved.
 |-----------------------------------------------------------------*/
return [
    'driver' => 'file', //file,redis
    'redis' => [
        'host' => '127.0.0.1',
        'port' => 6379,
        'pass' => '123456',
        'database' => 0,
    ],
];