<?php
/*------------------------------------------------------------------
 | 调试栏配置 2024-08-15 by 无念
 |------------------------------------------------------------------
 | Software: APHP - A PHP TOP Framework
 | Site: https://aphp.top
 |------------------------------------------------------------------
 | CopyRight(C)2020-2024 无念<24203741@qq.com>,All Rights Reserved.
 |-----------------------------------------------------------------*/
return [
    // 调试栏选项显示
    'tabs' => [
        'base' => '基本',
        'file' => '文件',
        'sql' => 'SQL',
        'debug' => '调试',
        'post' => 'POST',
        'get' => 'GET',
        'cookie' => 'COOKIE',
        'session' => 'SESSION',
        'error' => '错误',
    ],
    'is_hide' => false, // 是否隐藏
    'show_html_footer' => true, // 是否显示html页脚注释
];