<?php
/*------------------------------------------------------------------
 | Software: APHP - A PHP TOP Framework
 | Site: https://aphp.top
 |------------------------------------------------------------------
 | CopyRight(C)2020-2024 大松栩<24203741@qq.com>,All Rights Reserved.
 |-----------------------------------------------------------------*/
return [
    'user' => '/^\w{4,20}$/', //用户4-12位
    'pwd1' => '/^\w{1,12}$/', //密码1-12位
    'pwd6' => '/^\w{6,12}$/', //密码6-12位
    'number' => '/^[0-9]*$/', //正整数
    'chs' => '/^[\x7f-\xff]+$/', //汉字
    'mobile' => '/^1[3-9]\d{9}$/', //手机号
    'qq' => '/^[1-9][0-9]{4,12}$/', //QQ号
    'id_card' => '/^(\d{15}$|^\d{18}$|^\d{17}(\d|X|x))$/', //身份证号
    'bankcard' => '/^[1-9][0-9]{18}$/', //银行卡号
    'string' => '/^\w+$/', //字母数字下划线
    'chs_num' => '/^[\x7f-\xff0-9]+$/', //汉字数字
    'class_method' => '/^[a-z_]+\/[a-z_]+$/', //控制器/方法：index/about
    'route_key' => '/^[a-z0-9\-_\(\):]+$/', //路由配置键名：cat-(:num)
];